W7D2/Cats99/app/controllers/cat_rental_requests_controller.rb

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 LIMIT $2  [["cat_id", 1], ["LIMIT", 1]]
---
  def index
    debugger
    @requests = CatRentalRequest.find_by(cat_id: params[:id])