W7D2/Cats99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(strong_params)
    @cat.user_id = self.current_user.id

    if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "url", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat
      if @cat.update(strong_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "grey"], ["updated_at", "2021-03-01 21:49:27.630690"], ["id", 2]]

  def require_ownership
    has_ownership = self.current_user.cats.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]