W7D2/Cats99/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "roger raymondson"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, pwd)
    user = User.find_by(username: username)