W7D3/music-app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "IwUaYNI2TQk3eMYQ7xs6Mg"], ["LIMIT", 1]]
---
  def self.find_by_session_token(token)
    User.find_by(session_token: token)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jonathan@fakesite.com"], ["LIMIT", 1]]
---
  def self.find_with_password(params)
    user = User.find_by(email: params[:email])

INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zSs-zGA47kltgZ8006zbmw"], ["updated_at", "2021-03-03 08:30:46.903060"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!