W7D3/music-app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @band = Band.new(strong_params)

    if @band
      if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "bands" SET "image_url" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["image_url", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Moranbong_band%2C_2013.png/440px-Moranbong_band%2C_2013.png"], ["updated_at", "2021-03-03 03:33:25.123767"], ["id", 8]]
---
  def update
    @band = Band.find_by(id: params[:id])

    if @band
      if @band.update(strong_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 8]]
---
  def destroy
    @band = Band.find_by(id: params[:id])

    if @band
      if @band.destroy