W7D3/music-app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(strong_params)

    if user.save